src/InformationRegisters/ЛогированиеАгентКИП/ЛогированиеАгентКИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогированиеАгентКИП</name>
  <attributes>
    <name>Направление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛогированиеАгентКИП/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьДанные(АгентКИП, Данные, Направление) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    НаборЗаписей = СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Дата.Установить(ТекДата);
    НаборЗаписей.Отбор.АгентКИП.Установить(АгентКИП);
    
    НовСтрока = НаборЗаписей.Добавить();
    НовСтрока.АгентКИП = АгентКИП;
    НовСтрока.Дата = ТекДата;
    НовСтрока.Направление = Направление;
    НовСтрока.Данные = Данные;
    НаборЗаписей.Записать(Ложь);
    
КонецПроцедуры

#КонецОбласти
